"""
Создать два объекта класса Dog. Вывести их на экран
"""


class Dog:
    pass


dog1 = Dog
dog2 = Dog

print(dog1)
print(dog2)
